##У Змея-Горыныча 2000 голов. Сказочный богатырь может срубить ему одним ударом меча
##33, 21, 17 или 1 голову, но при этом у Змея вырастает взамен соответственно 48, 0, 14 или
##349 голов. Если отрублены все головы, то новые не вырастают. Как богатырю одалеть
##Змея?
heads = int(input('Введіть кількість голів: '))
count = 0
while heads != 0:
    if  heads == 1 or heads == 17 or heads == 33 or heads == 21:
        print('Ви перемогли! Відрубали таку к-сть голів:',heads )
        heads = 0
    elif ((40 >= heads > 22 or heads == 20) and heads != 38) :
            heads -= 3
            print ('Відрубали 17! Виросло 14. залишилося',heads)
    elif heads - 21 >= 1 :
        heads -= 21;
        print ('Відрубали 21! залишилося',heads)
    elif heads < 20:
        heads +=348;
        print ('Відрубали 1! Виросло 349. залишилося',heads)
    count +=1
print('iteration', count)
        
